{"modelTopology": {"training_config": {"metrics": ["accuracy"], "loss": "categorical_crossentropy", "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 4.999999987376214e-07, "epsilon": 1e-07, "amsgrad": false, "lr": 9.999999747378752e-05}}, "sample_weight_mode": null, "loss_weights": null}, "keras_version": "2.2.4", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "name": "input_38", "sparse": false}, "name": "input_38"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["input_38", 0, 0, {}]]], "config": {"padding": [[0, 1], [0, 1]], "trainable": true, "name": "Conv1_pad", "data_format": "channels_last"}, "name": "Conv1_pad"}, {"class_name": "Conv2D", "inbound_nodes": [[["Conv1_pad", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Conv1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "Conv1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["Conv1", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn_Conv1", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "bn_Conv1"}, {"class_name": "ReLU", "inbound_nodes": [[["bn_Conv1", 0, 0, {}]]], "config": {"threshold": 0.0, "max_value": 6.0, "trainable": true, "name": "Conv1_relu", "negative_slope": 0.0}, "name": "Conv1_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["Conv1_relu", 0, 0, {}]]], "config": {"padding": "same", "depth_multiplier": 1, "name": "expanded_conv_depthwise", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "expanded_conv_depthwise"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["expanded_conv_depthwise", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "expanded_conv_depthwise_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "expanded_conv_depthwise_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["expanded_conv_depthwise_BN", 0, 0, {}]]], "config": {"threshold": 0.0, "max_value": 6.0, "trainable": true, "name": "expanded_conv_depthwise_relu", "negative_slope": 0.0}, "name": "expanded_conv_depthwise_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["expanded_conv_depthwise_relu", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "expanded_conv_project", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "expanded_conv_project"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["expanded_conv_project", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "expanded_conv_project_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "expanded_conv_project_BN"}, {"class_name": "Conv2D", "inbound_nodes": [[["expanded_conv_project_BN", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_1_expand", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_1_expand"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_1_expand", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_1_expand_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_1_expand_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_1_expand_BN", 0, 0, {}]]], "config": {"threshold": 0.0, "max_value": 6.0, "trainable": true, "name": "block_1_expand_relu", "negative_slope": 0.0}, "name": "block_1_expand_relu"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["block_1_expand_relu", 0, 0, {}]]], "config": {"padding": [[0, 1], [0, 1]], "trainable": true, "name": "block_1_pad", "data_format": "channels_last"}, "name": "block_1_pad"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_1_pad", 0, 0, {}]]], "config": {"padding": "valid", "depth_multiplier": 1, "name": "block_1_depthwise", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "strides": [2, 2], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block_1_depthwise"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_1_depthwise", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_1_depthwise_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_1_depthwise_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_1_depthwise_BN", 0, 0, {}]]], "config": {"threshold": 0.0, "max_value": 6.0, "trainable": true, "name": "block_1_depthwise_relu", "negative_slope": 0.0}, "name": "block_1_depthwise_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["block_1_depthwise_relu", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_1_project", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 24, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_1_project"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_1_project", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_1_project_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_1_project_BN"}, {"class_name": "Conv2D", "inbound_nodes": [[["block_1_project_BN", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_2_expand", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 144, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_2_expand"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_2_expand", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_2_expand_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_2_expand_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_2_expand_BN", 0, 0, {}]]], "config": {"threshold": 0.0, "max_value": 6.0, "trainable": true, "name": "block_2_expand_relu", "negative_slope": 0.0}, "name": "block_2_expand_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_2_expand_relu", 0, 0, {}]]], "config": {"padding": "same", "depth_multiplier": 1, "name": "block_2_depthwise", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block_2_depthwise"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_2_depthwise", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_2_depthwise_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_2_depthwise_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_2_depthwise_BN", 0, 0, {}]]], "config": {"threshold": 0.0, "max_value": 6.0, "trainable": true, "name": "block_2_depthwise_relu", "negative_slope": 0.0}, "name": "block_2_depthwise_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["block_2_depthwise_relu", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_2_project", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 24, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_2_project"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_2_project", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_2_project_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_2_project_BN"}, {"class_name": "Add", "inbound_nodes": [[["block_1_project_BN", 0, 0, {}], ["block_2_project_BN", 0, 0, {}]]], "config": {"trainable": true, "name": "block_2_add"}, "name": "block_2_add"}, {"class_name": "Conv2D", "inbound_nodes": [[["block_2_add", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_3_expand", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 144, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_3_expand"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_3_expand", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_3_expand_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_3_expand_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_3_expand_BN", 0, 0, {}]]], "config": {"threshold": 0.0, "max_value": 6.0, "trainable": true, "name": "block_3_expand_relu", "negative_slope": 0.0}, "name": "block_3_expand_relu"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["block_3_expand_relu", 0, 0, {}]]], "config": {"padding": [[0, 1], [0, 1]], "trainable": true, "name": "block_3_pad", "data_format": "channels_last"}, "name": "block_3_pad"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_3_pad", 0, 0, {}]]], "config": {"padding": "valid", "depth_multiplier": 1, "name": "block_3_depthwise", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "strides": [2, 2], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block_3_depthwise"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_3_depthwise", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_3_depthwise_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_3_depthwise_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_3_depthwise_BN", 0, 0, {}]]], "config": {"threshold": 0.0, "max_value": 6.0, "trainable": true, "name": "block_3_depthwise_relu", "negative_slope": 0.0}, "name": "block_3_depthwise_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["block_3_depthwise_relu", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_3_project", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_3_project"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_3_project", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_3_project_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_3_project_BN"}, {"class_name": "Conv2D", "inbound_nodes": [[["block_3_project_BN", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_4_expand", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_4_expand"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_4_expand", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_4_expand_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_4_expand_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_4_expand_BN", 0, 0, {}]]], "config": {"threshold": 0.0, "max_value": 6.0, "trainable": true, "name": "block_4_expand_relu", "negative_slope": 0.0}, "name": "block_4_expand_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_4_expand_relu", 0, 0, {}]]], "config": {"padding": "same", "depth_multiplier": 1, "name": "block_4_depthwise", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block_4_depthwise"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_4_depthwise", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_4_depthwise_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_4_depthwise_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_4_depthwise_BN", 0, 0, {}]]], "config": {"threshold": 0.0, "max_value": 6.0, "trainable": true, "name": "block_4_depthwise_relu", "negative_slope": 0.0}, "name": "block_4_depthwise_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["block_4_depthwise_relu", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_4_project", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_4_project"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_4_project", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_4_project_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_4_project_BN"}, {"class_name": "Add", "inbound_nodes": [[["block_3_project_BN", 0, 0, {}], ["block_4_project_BN", 0, 0, {}]]], "config": {"trainable": true, "name": "block_4_add"}, "name": "block_4_add"}, {"class_name": "Conv2D", "inbound_nodes": [[["block_4_add", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_5_expand", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_5_expand"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_5_expand", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_5_expand_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_5_expand_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_5_expand_BN", 0, 0, {}]]], "config": {"threshold": 0.0, "max_value": 6.0, "trainable": true, "name": "block_5_expand_relu", "negative_slope": 0.0}, "name": "block_5_expand_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_5_expand_relu", 0, 0, {}]]], "config": {"padding": "same", "depth_multiplier": 1, "name": "block_5_depthwise", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block_5_depthwise"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_5_depthwise", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_5_depthwise_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_5_depthwise_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_5_depthwise_BN", 0, 0, {}]]], "config": {"threshold": 0.0, "max_value": 6.0, "trainable": true, "name": "block_5_depthwise_relu", "negative_slope": 0.0}, "name": "block_5_depthwise_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["block_5_depthwise_relu", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_5_project", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_5_project"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_5_project", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_5_project_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_5_project_BN"}, {"class_name": "Add", "inbound_nodes": [[["block_4_add", 0, 0, {}], ["block_5_project_BN", 0, 0, {}]]], "config": {"trainable": true, "name": "block_5_add"}, "name": "block_5_add"}, {"class_name": "Conv2D", "inbound_nodes": [[["block_5_add", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_6_expand", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_6_expand"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_6_expand", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_6_expand_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_6_expand_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_6_expand_BN", 0, 0, {}]]], "config": {"threshold": 0.0, "max_value": 6.0, "trainable": true, "name": "block_6_expand_relu", "negative_slope": 0.0}, "name": "block_6_expand_relu"}, {"class_name": "ZeroPadding2D", "inbound_nodes": [[["block_6_expand_relu", 0, 0, {}]]], "config": {"padding": [[0, 1], [0, 1]], "trainable": true, "name": "block_6_pad", "data_format": "channels_last"}, "name": "block_6_pad"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_6_pad", 0, 0, {}]]], "config": {"padding": "valid", "depth_multiplier": 1, "name": "block_6_depthwise", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "strides": [2, 2], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block_6_depthwise"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_6_depthwise", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_6_depthwise_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_6_depthwise_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_6_depthwise_BN", 0, 0, {}]]], "config": {"threshold": 0.0, "max_value": 6.0, "trainable": true, "name": "block_6_depthwise_relu", "negative_slope": 0.0}, "name": "block_6_depthwise_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["block_6_depthwise_relu", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_6_project", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_6_project"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_6_project", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_6_project_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_6_project_BN"}, {"class_name": "Conv2D", "inbound_nodes": [[["block_6_project_BN", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_7_expand", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 384, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_7_expand"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_7_expand", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_7_expand_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_7_expand_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_7_expand_BN", 0, 0, {}]]], "config": {"threshold": 0.0, "max_value": 6.0, "trainable": true, "name": "block_7_expand_relu", "negative_slope": 0.0}, "name": "block_7_expand_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_7_expand_relu", 0, 0, {}]]], "config": {"padding": "same", "depth_multiplier": 1, "name": "block_7_depthwise", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block_7_depthwise"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_7_depthwise", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_7_depthwise_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_7_depthwise_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_7_depthwise_BN", 0, 0, {}]]], "config": {"threshold": 0.0, "max_value": 6.0, "trainable": true, "name": "block_7_depthwise_relu", "negative_slope": 0.0}, "name": "block_7_depthwise_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["block_7_depthwise_relu", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_7_project", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_7_project"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_7_project", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_7_project_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_7_project_BN"}, {"class_name": "Add", "inbound_nodes": [[["block_6_project_BN", 0, 0, {}], ["block_7_project_BN", 0, 0, {}]]], "config": {"trainable": true, "name": "block_7_add"}, "name": "block_7_add"}, {"class_name": "Conv2D", "inbound_nodes": [[["block_7_add", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_8_expand", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 384, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_8_expand"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_8_expand", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_8_expand_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_8_expand_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_8_expand_BN", 0, 0, {}]]], "config": {"threshold": 0.0, "max_value": 6.0, "trainable": true, "name": "block_8_expand_relu", "negative_slope": 0.0}, "name": "block_8_expand_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_8_expand_relu", 0, 0, {}]]], "config": {"padding": "same", "depth_multiplier": 1, "name": "block_8_depthwise", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block_8_depthwise"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_8_depthwise", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_8_depthwise_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_8_depthwise_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_8_depthwise_BN", 0, 0, {}]]], "config": {"threshold": 0.0, "max_value": 6.0, "trainable": true, "name": "block_8_depthwise_relu", "negative_slope": 0.0}, "name": "block_8_depthwise_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["block_8_depthwise_relu", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_8_project", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_8_project"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_8_project", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_8_project_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_8_project_BN"}, {"class_name": "Add", "inbound_nodes": [[["block_7_add", 0, 0, {}], ["block_8_project_BN", 0, 0, {}]]], "config": {"trainable": true, "name": "block_8_add"}, "name": "block_8_add"}, {"class_name": "Conv2D", "inbound_nodes": [[["block_8_add", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_9_expand", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 384, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_9_expand"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_9_expand", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_9_expand_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_9_expand_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_9_expand_BN", 0, 0, {}]]], "config": {"threshold": 0.0, "max_value": 6.0, "trainable": true, "name": "block_9_expand_relu", "negative_slope": 0.0}, "name": "block_9_expand_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_9_expand_relu", 0, 0, {}]]], "config": {"padding": "same", "depth_multiplier": 1, "name": "block_9_depthwise", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block_9_depthwise"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_9_depthwise", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_9_depthwise_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_9_depthwise_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_9_depthwise_BN", 0, 0, {}]]], "config": {"threshold": 0.0, "max_value": 6.0, "trainable": true, "name": "block_9_depthwise_relu", "negative_slope": 0.0}, "name": "block_9_depthwise_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["block_9_depthwise_relu", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_9_project", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_9_project"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_9_project", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_9_project_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_9_project_BN"}, {"class_name": "Add", "inbound_nodes": [[["block_8_add", 0, 0, {}], ["block_9_project_BN", 0, 0, {}]]], "config": {"trainable": true, "name": "block_9_add"}, "name": "block_9_add"}, {"class_name": "Conv2D", "inbound_nodes": [[["block_9_add", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_10_expand", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 384, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block_10_expand"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_10_expand", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_10_expand_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_10_expand_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_10_expand_BN", 0, 0, {}]]], "config": {"threshold": 0.0, "max_value": 6.0, "trainable": true, "name": "block_10_expand_relu", "negative_slope": 0.0}, "name": "block_10_expand_relu"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["block_10_expand_relu", 0, 0, {}]]], "config": {"padding": "same", "depth_multiplier": 1, "name": "block_10_depthwise", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "depthwise_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block_10_depthwise"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block_10_depthwise", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "block_10_depthwise_BN", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.999, "axis": -1}, "name": "block_10_depthwise_BN"}, {"class_name": "ReLU", "inbound_nodes": [[["block_10_depthwise_BN", 0, 0, {}]]], "config": {"threshold": 0.0, "max_value": 6.0, "trainable": true, "name": "block_10_depthwise_relu", "negative_slope": 0.0}, "name": "block_10_depthwise_relu"}, {"class_name": "Conv2D", "inbound_nodes": [[["block_10_depthwise_relu", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block_10_project", "kernel_constraint": null, 